Revit 2027 API
Application.NewGeometryOptions Method
Creates an object to specify user preferences in parsing of geometry.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Options NewGeometryOptions()
Public Function NewGeometryOptions As Options
public:
Options^ NewGeometryOptions()
member NewGeometryOptions : unit -> Options
Return Value
Options
Example
Autodesk.Revit.DB.Options geomOption = application.Create.NewGeometryOptions();
if (null != geomOption)
{
    geomOption.ComputeReferences = true;
    geomOption.DetailLevel = Autodesk.Revit.DB.ViewDetailLevel.Fine;
    // Either the DetailLevel or the View can be set, but not both
    //geomOption.View = commandData.Application.Application.ActiveDocument.ActiveView;
    TaskDialog.Show("Revit", "Geometry Option created successfully.");
}
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace